10_Message_Contract_in_WCF/WebClient/WebClient/web_messages.svclog

<E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2016-03-13T15:30:20.9453128Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{b270e93d-a738-4a2a-80f6-3b4353505bb1}" /><Execution ProcessName="iisexpress" ProcessID="5864" ThreadID="8" /><Channel/><Computer>GO-PC</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2016-03-13T16:30:20.9413125+01:00" Source="TransportSend" Type="System.ServiceModel.Dispatcher.OperationFormatter+OperationFormatterMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><Addressing><Action>http://tempuri.org/IEmployeeService/GetEmployee</Action><To>http://localhost:8080/EmployeeService</To></Addressing><HttpRequest><Method>POST</Method><QueryString></QueryString><WebHeaders><VsDebuggerCausalityData>uIDPo3wRND6Zo5JPiwZwqAhZSZAAAAAAvwGviQwOWU+SxD+DOnwFcTO3wvoW8TpFu5LMjGczDsgACQAA</VsDebuggerCausalityData></WebHeaders></HttpRequest><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header><ActivityId CorrelationId="21d55b86-14c4-4760-a304-19f965bbc723" xmlns="http://schemas.microsoft.com/2004/09/ServiceModel/Diagnostics">b270e93d-a738-4a2a-80f6-3b4353505bb1</ActivityId></s:Header><s:Body><GetEmployee xmlns="http://tempuri.org/"><id>1</id></GetEmployee></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2016-03-13T15:30:22.3103909Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{b270e93d-a738-4a2a-80f6-3b4353505bb1}" /><Execution ProcessName="iisexpress" ProcessID="5864" ThreadID="8" /><Channel/><Computer>GO-PC</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2016-03-13T16:30:22.2773890+01:00" Source="TransportReceive" Type="System.ServiceModel.Channels.BufferedMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><HttpResponse><StatusCode>OK</StatusCode><StatusDescription>OK</StatusDescription><WebHeaders><Content-Length>568</Content-Length><Content-Type>text/xml; charset=utf-8</Content-Type><Date>Sun, 13 Mar 2016 15:30:22 GMT</Date><Server>Microsoft-HTTPAPI/2.0</Server></WebHeaders></HttpResponse><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header></s:Header><s:Body><GetEmployeeResponse xmlns="http://tempuri.org/"><GetEmployeeResult i:type="b:FullTimeEmployee" xmlns:a="http://kejeiri.com/13/03/2016" xmlns:i="http://www.w3.org/2001/XMLSchema-instance" xmlns:b="http://schemas.datacontract.org/2004/07/EmployeeService"><a:ID>1</a:ID><a:Name>Mark</a:Name><a:Gender>Male</a:Gender><a:DateOfBirth>1980-10-10T00:00:00</a:DateOfBirth><a:Type>FullTimeEmployee</a:Type><b:AnnualSalary>12</b:AnnualSalary></GetEmployeeResult></GetEmployeeResponse></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2016-03-13T15:30:25.5245747Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{dcb00c7a-54f5-4c4f-91f2-1ebc2092093c}" /><Execution ProcessName="iisexpress" ProcessID="5864" ThreadID="7" /><Channel/><Computer>GO-PC</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2016-03-13T16:30:25.5245747+01:00" Source="TransportSend" Type="System.ServiceModel.Dispatcher.OperationFormatter+OperationFormatterMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><Addressing><Action>http://tempuri.org/IEmployeeService/GetEmployee</Action><To>http://localhost:8080/EmployeeService</To></Addressing><HttpRequest><Method>POST</Method><QueryString></QueryString><WebHeaders><VsDebuggerCausalityData>uIDPo30RND6Zo5JPiwZwqAhZSZAAAAAAvwGviQwOWU+SxD+DOnwFcTO3wvoW8TpFu5LMjGczDsgACQAA</VsDebuggerCausalityData></WebHeaders></HttpRequest><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header><ActivityId CorrelationId="f06938ac-93f2-4cc7-b98c-6efd1a66a2c6" xmlns="http://schemas.microsoft.com/2004/09/ServiceModel/Diagnostics">dcb00c7a-54f5-4c4f-91f2-1ebc2092093c</ActivityId></s:Header><s:Body><GetEmployee xmlns="http://tempuri.org/"><id>12</id></GetEmployee></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2016-03-13T15:30:25.5425757Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{dcb00c7a-54f5-4c4f-91f2-1ebc2092093c}" /><Execution ProcessName="iisexpress" ProcessID="5864" ThreadID="7" /><Channel/><Computer>GO-PC</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2016-03-13T16:30:25.5415757+01:00" Source="TransportReceive" Type="System.ServiceModel.Channels.BufferedMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><HttpResponse><StatusCode>OK</StatusCode><StatusDescription>OK</StatusDescription><WebHeaders><Content-Length>594</Content-Length><Content-Type>text/xml; charset=utf-8</Content-Type><Date>Sun, 13 Mar 2016 15:30:25 GMT</Date><Server>Microsoft-HTTPAPI/2.0</Server></WebHeaders></HttpResponse><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header></s:Header><s:Body><GetEmployeeResponse xmlns="http://tempuri.org/"><GetEmployeeResult i:type="b:PartTimeEmployee" xmlns:a="http://kejeiri.com/13/03/2016" xmlns:i="http://www.w3.org/2001/XMLSchema-instance" xmlns:b="http://schemas.datacontract.org/2004/07/EmployeeService"><a:ID>12</a:ID><a:Name>Mark</a:Name><a:Gender>Male</a:Gender><a:DateOfBirth>1980-10-10T00:00:00</a:DateOfBirth><a:Type>PartTimeEmployee</a:Type><b:HourlyPay>1</b:HourlyPay><b:HoursWorked>1</b:HoursWorked></GetEmployeeResult></GetEmployeeResponse></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2016-03-13T17:42:58.5382663Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{4442213c-8e90-44ac-8421-bb900cb49dae}" /><Execution ProcessName="iisexpress" ProcessID="5812" ThreadID="6" /><Channel/><Computer>GO-PC</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2016-03-13T18:42:58.5352662+01:00" Source="TransportSend" Type="System.ServiceModel.Dispatcher.OperationFormatter+OperationFormatterMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><Addressing><Action>http://tempuri.org/IEmployeeService/GetEmployeeInfo</Action><To>http://localhost:8080/EmployeeService</To></Addressing><HttpRequest><Method>POST</Method><QueryString></QueryString><WebHeaders><VsDebuggerCausalityData>uIDPoxGJ0xA2RbJMqj3thpqh0XQAAAAAfDd8iaX9MUSF5QXMjonw8/7Fon2Au3FLvcCK3PhhNFUACQAA</VsDebuggerCausalityData></WebHeaders></HttpRequest><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header><h:LicenseKey xmlns:h="http://MyCompany.com/Employee">sqfqsfsqdf</h:LicenseKey><ActivityId CorrelationId="e1df4a5b-4d87-40a3-ac3b-1921506593c5" xmlns="http://schemas.microsoft.com/2004/09/ServiceModel/Diagnostics">4442213c-8e90-44ac-8421-bb900cb49dae</ActivityId></s:Header><s:Body><EmployeeRequestObject xmlns="http://MyCompany.com/Employee"><EmployeeId>1</EmployeeId></EmployeeRequestObject></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2016-03-13T17:42:58.9742913Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{4442213c-8e90-44ac-8421-bb900cb49dae}" /><Execution ProcessName="iisexpress" ProcessID="5812" ThreadID="6" /><Channel/><Computer>GO-PC</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2016-03-13T18:42:58.9742913+01:00" Source="TransportReceive" Type="System.ServiceModel.Channels.BufferedMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><HttpResponse><StatusCode>OK</StatusCode><StatusDescription>OK</StatusDescription><WebHeaders><Content-Length>363</Content-Length><Content-Type>text/xml; charset=utf-8</Content-Type><Date>Sun, 13 Mar 2016 17:42:58 GMT</Date><Server>Microsoft-HTTPAPI/2.0</Server></WebHeaders></HttpResponse><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header></s:Header><s:Body><EmployeeInfoObject xmlns="http://MyCompany.com/Employee"><Id>1</Id><Name>Mark</Name><Gender>Male</Gender><DOB>1980-10-10T00:00:00</DOB><Type>FullTimeEmployee</Type><AnnualSalary>12</AnnualSalary><HourlyPay>0</HourlyPay><HoursWorked>0</HoursWorked></EmployeeInfoObject></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2016-03-13T17:43:04.4256031Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{199ddbe7-c2d7-44f4-ae67-ac8ee733c196}" /><Execution ProcessName="iisexpress" ProcessID="5812" ThreadID="10" /><Channel/><Computer>GO-PC</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2016-03-13T18:43:04.4256031+01:00" Source="TransportSend" Type="System.ServiceModel.Dispatcher.OperationFormatter+OperationFormatterMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><Addressing><Action>http://tempuri.org/IEmployeeService/SaveEmployee</Action><To>http://localhost:8080/EmployeeService</To></Addressing><HttpRequest><Method>POST</Method><QueryString></QueryString><WebHeaders><VsDebuggerCausalityData>uIDPoxKJ0xA2RbJMqj3thpqh0XQAAAAAfDd8iaX9MUSF5QXMjonw8/7Fon2Au3FLvcCK3PhhNFUACQAA</VsDebuggerCausalityData></WebHeaders></HttpRequest><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header><ActivityId CorrelationId="56004a68-6bd8-415b-868f-13c908ebed69" xmlns="http://schemas.microsoft.com/2004/09/ServiceModel/Diagnostics">199ddbe7-c2d7-44f4-ae67-ac8ee733c196</ActivityId></s:Header><s:Body><EmployeeInfoObject xmlns="http://MyCompany.com/Employee"><Id>20</Id><Name>Mark</Name><Gender>Male</Gender><DOB>1980-10-10T00:00:00</DOB><Type>FullTimeEmployee</Type><AnnualSalary>12</AnnualSalary><HourlyPay>0</HourlyPay><HoursWorked>0</HoursWorked></EmployeeInfoObject></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2016-03-13T17:43:04.4726058Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{199ddbe7-c2d7-44f4-ae67-ac8ee733c196}" /><Execution ProcessName="iisexpress" ProcessID="5812" ThreadID="10" /><Channel/><Computer>GO-PC</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2016-03-13T18:43:04.4716057+01:00" Source="TransportReceive" Type="System.ServiceModel.Channels.BufferedMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><HttpResponse><StatusCode>OK</StatusCode><StatusDescription>OK</StatusDescription><WebHeaders><Content-Length>86</Content-Length><Content-Type>text/xml; charset=utf-8</Content-Type><Date>Sun, 13 Mar 2016 17:43:04 GMT</Date><Server>Microsoft-HTTPAPI/2.0</Server></WebHeaders></HttpResponse><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header></s:Header><s:Body></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent>